// 星期
export const cnWeekPrefix = "\u661f\u671f";
// ["日", "一", "二", "三", "四", "五", "六"];
export const cnWeeks = [
  "\u65e5",
  "\u4e00",
  "\u4e8c",
  "\u4e09",
  "\u56db",
  "\u4e94",
  "\u516d",
];
// "正", "二", "三", "四", "五", "六", "七", "八", "九", "十", "冬", "腊"
export const cnMonths = [
  "\u6b63",
  "\u4e8c",
  "\u4e09",
  "\u56db",
  "\u4e94",
  "\u516d",
  "\u4e03",
  "\u516b",
  "\u4e5d",
  "\u5341",
  "\u51ac",
  "\u814a",
];
// 月
export const cnMonthSuffix = "\u6708";
// ["初", "十", "廿", "卅"]
export const cnDays = ["\u521d", "\u5341", "\u5eff", "\u5345"];
// ["一", "二", "三", "四", "五", "六", "七", "八", "九"]
export const cnDayUnits = [
  "\u4e00",
  "\u4e8c",
  "\u4e09",
  "\u56db",
  "\u4e94",
  "\u516d",
  "\u4e03",
  "\u516b",
  "\u4e5d",
  "\u5341",
];
// ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"]
export const cnZodiac = [
  "\u9f20",
  "\u725b",
  "\u864e",
  "\u5154",
  "\u9f99",
  "\u86c7",
  "\u9a6c",
  "\u7f8a",
  "\u7334",
  "\u9e21",
  "\u72d7",
  "\u732a",
];
// 阳历节日
export const sFestival = {
  "1-1": "元旦节",
  "2-14": "情人节",
  "5-1": "劳动节",
  "5-4": "青年节",
  "6-1": "儿童节",
  "9-10": "教师节",
  "10-1": "国庆节",
  "12-25": "圣诞节",
  "3-8": "妇女节",
  "3-12": "植树节",
  "4-1": "愚人节",
  "5-12": "护士节",
  "7-1": "建党节",
  "8-1": "建军节",
  "12-24": "平安夜",
};

// 阴历节日
export const lFestival = {
  "12-30": "除夕",
  "1-1": "春节",
  "1-15": "元宵节",
  "2-2": "龙抬头",
  "5-5": "端午节",
  "7-7": "七夕节",
  "7-15": "中元节",
  "8-15": "中秋节",
  "9-9": "重阳节",
  "10-1": "寒衣节",
  "10-15": "下元节",
  "12-8": "腊八节",
  "12-23": "北方小年",
  "12-24": "南方小年",
};
// ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
export const Gan = [
  "\u7532",
  "\u4e59",
  "\u4e19",
  "\u4e01",
  "\u620a",
  "\u5df1",
  "\u5e9a",
  "\u8f9b",
  "\u58ec",
  "\u7678",
];

// "子", "丑", "寅",  "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"
export const Zhi = [
  "\u5b50",
  "\u4e11",
  "\u5bc5",
  "\u536f",
  "\u8fb0",
  "\u5df3",
  "\u5348",
  "\u672a",
  "\u7533",
  "\u9149",
  "\u620c",
  "\u4ea5",
];
// 摩羯水瓶双鱼白羊金牛双子巨蟹狮子处女天秤天蝎射手摩羯
export const astroStrings = [
  "\u6469\u7faf\u5ea7",
  "\u6c34\u74f6\u5ea7",
  "\u53cc\u9c7c\u5ea7",
  "\u767d\u7f8a\u5ea7",
  "\u91d1\u725b\u5ea7",
  "\u53cc\u5b50\u5ea7",
  "\u5de8\u87f9\u5ea7",
  "\u72ee\u5b50\u5ea7",
  "\u5904\u5973\u5ea7",
  "\u5929\u79e4\u5ea7",
  "\u5929\u874e\u5ea7",
  "\u5c04\u624b\u5ea7",
  "\u6469\u7faf\u5ea7",
];
export const astroDays = [20, 19, 21, 21, 21, 22, 23, 23, 23, 23, 22, 22];
export const startYear = 1900;
export const startMonth = 1;
export const startDay = 31;
export const endYear = 2100;
